
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'bcrypt'
brew 'brotli'
brew 'buf'
brew 'c-ares'
brew 'ca-certificates'
brew 'capstone'
brew 'cfssl'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'dtc'
brew 'efm-langserver'
brew 'eza'
brew 'findutils'
brew 'fzf'
brew 'gettext'
brew 'gh'
brew 'glib'
brew 'gmp'
brew 'gnu-sed'
brew 'gnutls'
brew 'go'
brew 'go@1.22'
brew 'golang-migrate'
brew 'grpcurl'
brew 'icu4c'
brew 'jpeg-turbo'
brew 'jq'
brew 'k9s'
brew 'kube-ps1'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'libevent'
brew 'libgit2'
brew 'libidn2'
brew 'libnghttp2'
brew 'libpng'
brew 'libslirp'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'lima'
brew 'lpeg'
brew 'lua'
brew 'lua-language-server'
brew 'luajit'
brew 'luarocks'
brew 'luv'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mpdecimal'
brew 'msgpack'
brew 'ncurses'
brew 'neofetch'
brew 'neovim'
brew 'nettle'
brew 'node'
brew 'oh-my-posh'
brew 'oha'
brew 'oniguruma'
brew 'openldap'
brew 'openssl@3'
brew 'p11-kit'
brew 'pcre2'
brew 'pixman'
brew 'protobuf'
brew 'python@3.11'
brew 'python@3.12'
brew 'qemu'
brew 'rclone'
brew 'readline'
brew 'ripgrep'
brew 'rtmpdump'
brew 'screenresolution'
brew 'sevenzip'
brew 'snappy'
brew 'snzip'
brew 'sqlite'
brew 'stow'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vde'
brew 'wget'
brew 'xz'
brew 'zoxide'
brew 'zstd'

tap 'homebrew/cask'
cask '1password-cli'
cask 'alacritty'
cask 'font-jetbrains-mono-nerd-font'
cask 'google-cloud-sdk'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'

tap 'homebrew/services'

tap 'bufbuild/buf'

tap 'derailed/k9s'

tap 'jandedobbeleer/oh-my-posh'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'txn2/tap'
brew 'kubefwd'

tap 'utilitywarehouse/tap'
brew 'wiresteward'

tap 'uw-labs/tap'

# App Store applications
mas 'GarageBand (10.4.6)', id: 682658836
mas 'iMovie (10.3.4)', id: 408981434
mas 'Keynote (12.1)', id: 409183694
mas 'Numbers (12.1)', id: 409203825
mas 'Pages (12.1)', id: 409201541
