tap "bufbuild/buf"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "utilitywarehouse/tap"
tap "uw-labs/tap"
brew "bcrypt"
brew "cfssl"
brew "gnutls"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "libssh2"
brew "curl"
brew "docker"
brew "docker-compose"
brew "findutils"
brew "fzf"
brew "gnu-sed"
brew "golang-migrate"
brew "grpcurl"
brew "jq"
brew "kube-ps1"
brew "kubectx"
brew "kustomize"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "node"
brew "oha"
brew "ripgrep"
brew "snzip"
brew "tmux"
brew "wget"
brew "bufbuild/buf/buf"
brew "derailed/k9s/k9s"
brew "utilitywarehouse/tap/wiresteward"
brew "stow"
cask "1password-cli"
cask "alacritty"
